#!/usr/bin/env sh

####################################################
# AppSrc内でビルドする処理を記述するためのシェル
# シェルの実行はレポジトリのルートディレクトリになるため、package.jsonが存在するディレクトリへ移動してからyarnコマンドを実行する
####################################################

####################################################
# 依存ライブラリのインストール
####################################################

echo "########## Install packages ##########"
cd ./sample_app
yarn install

####################################################
# 単体テスト
####################################################

echo "########## Lint & Jest ##########"
yarn lint
yarn test

####################################################
# srcビルド
####################################################

echo "########## Build ##########"
yarn run build

####################################################
# Seleniumを使用した統合テスト
####################################################

# Start Next.js application in the background
echo "########## Integration Test ##########"
yarn run start > /dev/null 2>&1 &
echo "Next.js is running..."

echo "Run Selenium tests"
cd ./selenium
node sample_test.cjs
echo "Finished Selenium tests"
